[
  {
    "title": "Best Ever Banana Muffins",
    "ingredients": "<ul><li>3 large bananas</li><li>3/4 c. sugar</li><li>1 egg</li><li>1/3 c. melted butter</li><li>1 tsp baking soda</li><li>1 tsp baking powder</li><li>1/2 tsp salt</li><li>1 1/2 c. flour</li></ul>",
    "steps": "<ul><li>Mash the bananas.</li><li>Add sugar and egg. Mix well. </li><li>Add the melted butter.</li><li>Add the dry ingredients and cook 20 mins at 350F.</li></ul>"
  },
  <li></li>
  {
    "title": "Chocolate Chip Cookies",
    "ingredients": "<ul><li>2 1/4 cups all-purpose flour</li><li>1 teaspoon baking soda</li><li>Fine salt</li><li>1 1/2 sticks (12 tablespoons) unsalted butter, at room temperature</li><li>3/4 cup packed light brown sugar</li><li>2/3 cup granulated sugar</li><li>2 large eggs</li><li>1 teaspoon pure vanilla extract</li><li>One 12-ounce bag semisweet chocolate chips</li></ul>",
    "steps": "<ul><li>Position 2 racks in the center of the oven, and preheat to 375 degrees F. Line 2 baking sheets with parchment.</li><li>Whisk together the flour, baking soda and 1 teaspoon salt in a large bowl.</li><li>Beat the butter and both sugars on medium-high speed in the bowl of a stand mixer fitted with a paddle attachment (or in a large bowl if using a handheld mixer) until light and fluffy, about 4 minutes. Add the eggs, one at time, beating after each addition to incorporate. Beat in the vanilla. Scrape down the side of the bowl as needed. Reduce the speed to medium, add the flour mixture and beat until just incorporated. Stir in the chocolate chips.</li><li>Scoop 12 heaping tablespoons of dough about 2 inches apart onto each prepared baking sheet. Roll the dough into balls with slightly wet hands. Bake, rotating the cookie sheets from upper to lower racks halfway through, until golden but still soft in the center, 12 to 15 minutes (the longer the cook time, the crunchier the cookies). Let cool for a few minutes on the baking sheet, and then transfer to a rack to cool completely.</li><li>Let the baking sheets cool completely, scoop the remaining dough onto 1 sheet and bake. Store the cookies in a tightly sealed container at room temperature for up to 5 days.</li></ul>"
  },
  {
    "title": "Lemon Loaf",
    "ingredients": "<ul><li>1/2 cup butter</li><li>1 cup sugar</li><li>2 eggs</li><li>1 1/2 cups flour</li><li>1 tsp baking powder</li><li>1/4 tsp salt</li><li>1/2 cup milk</li><li>Grated rind from 1 lemon</li><li>Juice from 1 lemon</li><li>1/4 cup sugar</li></ul>",
    "steps": "<ul><liPreheat your oven to 350 degrees.</li><li>Prepare a loaf pan by lining it with wax paper. Set aside.</li><li>With a mixer cream together the butter and sugar.</li><li>Add in the eggs, 1 at a time.</li><li>In a separate bowl combine the flour, baking powder and salt.</li><li>Add 1/2 of the flour mix to the butter mix.</li><li>Then add 1/2 of the milk.</li><li>Add the remaining flour mix.</li><li>Mix in the remaining milk and lemon gratings.</li><li>Bake for 45-50 minutes, or until a toothpick inserted into the centre comes out clean.</li><li>In the mean time, combine the juice from 1 lemon with 1/4 cup sugar.</li><li>When the cake is done baking, take it out of the oven, and pierce holes in it with a knife - make sure to get to the bottom of the loaf so the lemon juice mixture can get right down into the cake. Pour lemon juice/sugar mix over warm cake.</li><li>Let sit. This cake is even better the next day.</li></ul>"
  },
  {
    "title": "Spaghetti Bolognese",
    "ingredients": "<ul><li>2 tablespoons olive oil</li><li>1 large onion</li><li>1 pound ground beef</li><li>1 tablespoon dried oregano</li><li>28 ounces crushed tomatoes</li><li>3 cloves garlic</li><li>2 tablespoons tomato paste</li><li>1 good sized handful fresh parsley</li><li>Salt and pepper</li><li>1/2 pound spaghetti</li><li>Grated Pecorino Romano or Parmesan cheese for serving</li></ul>",
    "steps": "<ul><li>Heat the olive oil in a large pan over medium heat. Add the onions and sauté until lightly golden, 2 to 3 minutes. Add the garlic and fry another minute.</li><li>Add the ground beef; fry until fully cooked and no pink shows at all in the meat (about 8 minutes). Add the oregano and tomato paste and mix with the meat.</li><li>Add the tomatoes, parsley, and bring to a boil. Season with the salt and pepper. Reduce the heat to low, and cook for at least 15 minutes (you can cook longer for a deeper flavor).</li><li>In the meantime, cook the spaghetti according to the package instructions. Drain and serve topped with the sauce and cheese (if using).</li></ul>"
  },
  {
    "title": "Paella",
    "ingredients": "<ul><li>4 small lobster tails (6-12 oz each)</li><li>Water</li><li>3 tbsp Extra Virgin Olive Oil</li><li>1 large yellow onion, chopped</li><li>2 cups Spanish rice or medium-grain rice, soaked in water for 20 minutes and then drained</li><li>4 garlic cloves, chopped</li><li>2 large pinches of Spanish saffron threads soaked in 1/2 cup water</li><li>1 tsp Sweet Spanish paprika</li><li>1 tsp cayenne pepper</li><li>1/2 tsp chile pepper flakes</li><li>Salt</li><li>2 large Roma tomatoes, finely chopped</li><li>6 oz French green beans, trimmed</li><li>1 lb prawns or large shrimp or your choice, peeled and deveined</li><li>1/4 cup chopped fresh parsley</li></ul>",
    "steps": "<ul><li>In a large pot, bring 3 cups of water to a rolling boil. Add the lobster tails and let boil very briefly (1-2 minutes) until pink. Turn the heat off. Remove the lobster tails with a pair of tongs. Do not discard the lobster cooking water. When the lobster is cool enough to handle, remove the shell and cut into large chunks.</li><li>In a large deep pan or cast iron skillet, heat 3 tbsp olive oil. Turn the heat to medium-high and add the chopped onions. Saute the onions for 2 minutes then add the rice, and cook for 3 more minutes, stirring regularly. Now add the chopped garlic and the lobster cooking water. Stir in the saffron and it's soaking liquid, paprika, cayenne pepper, aleppo pepper, and salt. Stir in the chopped tomatoes and green beans. Bring to a boil and let the liquid slightly reduce, then cover (with lid or tightly with foil) and cook on low heat for 20 minutes.</li><li>Uncover and spread the shrimp over the rice, pushing it into the rice slightly. Add a little water if needed. Cover and cook for another 10 minutes or until the shrimp turns pink. Finally, add the cooked lobster chunks. When the lobster is warmed through, turn heat off. Garnish with parsley.</li><li>Serve the paella hot with your favorite white wine.</li></ul>"
  }]